// In utils/baseMapping.ts
type BaseKey = 'base0' | 'base2' | 'base3' | 'base4' | 'base5' | 'base6' | 'base7' | 
                'base8' | 'base9' | 'base910' | 'base911' | 'base912' | 'base913' | 'base914'| 'base915'| 'base916'| 'base917' | 'basemeeting1'| 'basemeeting2';

export const baseNames: Record<BaseKey, string> = {
    'base0': 'จุดรับของที่ระลึก',
    'base2': '4 หลักสูตร (วิชาการ)',
    'base3': 'แผนฯ เตรียมมนุษย์-ครุศาสตร์ การกีฬา',
    'base4': 'แผนฯ เตรียมศิลปกรรม',
    'base5': 'ห้องเรียนวิทย์-เทคโนโลยี #หุ่นยนต์',
    'base6': 'แผนฯ เตรียมนิเทศ',
    'base7': 'โครงการภาคภาษาอังกฤษ',
    'base8': 'แผนฯ เตรียมนิติ-รัฐศาสตร์',
    'base9': 'แผนฯ เตรียมมนุษย์-ครุศาสตร์',
    'base910': 'ห้องเรียนเตรียมแพทย์ ม.ต้น',
    'base911': 'แผนฯ เตรียมบริหารธุรกิจ บัญชี และการบริการ',
    'base912': 'แผนฯ เตรียมเภสัช-สหเวช',
    'base913': 'แผนฯ เตรียมแพทย์',
    'base914': 'แผนฯ เตรียมวิทย์คอม',
    'base915': 'แผนฯ เตรียมวิศวะ',
    'base916': 'แผนฯ เตรียมสถาปัตย์',
    'base917': 'ห้องเรียน Inter',
    'basemeeting1': 'IEP / GP รอบเช้า เวลา 10.00 - 12.00 น.',
    'basemeeting2': 'IP / EP รอบเช้า เวลา 13.00 - 15.00 น.'
} as const;
            

export const stateTextMap = {
    1: "โครงการฯ IEP / GP รอบเช้า เวลา 10.00 - 12.00 น.",
    2: "โครงการฯ IP / EP รอบบ่าย เวลา 13.00 - 15.00 น.",
    3: "ทั้งรอบเช้า และ รอบบ่าย",
};

export type { BaseKey };
